import random as r

coins = 0

def printParameters():
    print("У тебя {0} монет.".format(coins))

def printCoins():
    print("У тебя", coins, "монет.")


print("Привет, это текстовая новела.")

print("Ты попадаешь в бар")

def meetShop():

    global coins

    def buy(cost):
        global coins
        if coins >= cost:
            coins -= cost
            printCoins()
            return True
        print("У тебя маловато монет!")
        return False

weapons = ["Водка", "Маргарита", "Пиво", "Вода", "Кузнечик", "Кровавая Мэри"]
weaponCost = r.randint(3, 10)
weapon = r.choice(weapons)

one = 1

while input("Что ты будешь делать? (зайти/уйти): ").lower() == "зайти":
    print("1) Подойти к девушке -", one, "")
    print("2)  {0} {1}  Выпить".format(weapon, weaponCost))


    choice = input("Что Выбереш?: ")
    if choice == "1":
            if (one):
                input("Заговорить? (да/нет): ")
                if "да":
                    input("Что Выбереш?: 1) Я увидела , что ты сидишь одна, хотелось найти компанию. Не хочешь пообщаться ?.\n 2) Привет")
                    if"1":
                        print("Да, почему бы и нет")
                        input("Тут такая музыка чудная. Что Выбереш?: \n 1) О, что пьёшь? \n 2) Что кввасишь?")
                        if"1":
                            print("Мартини")
                            input("Что Выбереш?: 1) Тебе нравится данный напиток? \n 2) Поделишся?")
                            if"1":
                                print("Думаю да, может и ты выпьешь?")
                                input("1) Да, почему нет \n 2) нет")
                                if"1":
                                    input("1)  Какие ещё предпочитаешь ? \n 2) А почему выбрала именно это место, ведь есть множество крутых заведений , где проводят самые бомбезные тусовки?")
                                    if"1":
                                        print("Пиво под сериальчик")
                                        input("Кстати, не хочешь глянуть \n 1) Да \n 2) Нет")
                                        if "1":
                                            print("Вы поехали к ней домой...")
                                            print("Дома... \n Зайдя в квартиру, я сразу потащила Алю мыть ручки. После я включила сериал, который мы собирались посмотреть. Усевшись удобно на диване, мы начали смотреть. \n Я никак не могла сосредоточиться и постоянно мой взгляд падал на губы Али. Они очень соблазнительные, большие, идеальной формы, красивого розового оттенка. Мне так и хотелось их поцеловать и укусить до крови, но я старалась держать себя в руках.\n Спустя примерно пол часа, я решила предложить ей сладенькое, Аля с удовольствием согласилась. Я принесла конфеты и мы сели дальше смотреть, я следила за тем, чтобы не съесть случайно конфету со снотворным и к счастью у меня оказалась отличная память.\n Я заснула время, Аля съела штук пять конфет с секретом. Спустя минут десять, она легла на мои колени и незаметно для себя заснула. Я начала действовать, времени было немного.\n Я выключила сериал и перетащила Алю на кровать. Я начала ее раздевать, увидев очень милые розовые трусики, я оставила их на ней. Сняв все, я достала верёвку и начала связывать ее, привязывая конечности так, что она лежала в позе морской звёзды. Дальше я достала кляп и вставила ей его в ротик. Дальше я села рядом и начала ждать ее пробуждения, самое интересное было впереди...\n Прошло пятнадцать минут...\n Аля медленно открыла глаза и попыталась пошевелиться. Когда она не смогла это сделать, то резко открыла глаза и попыталась что-то произнести.\n - С пробуждением, солнышко! Как же долго, я этого ждала, прости, но пока говорить ты не можешь, но я надеюсь тебе понравится)\n Я достала из под кровати игрушки. Глаза Али округлились.\n - О, я вижу тебе уже нравится)\n Я начала раздеваться догола и поняла, что уже очень сильно возбуждена.\n - Знаешь, а ведь сегодня ты лишишься девственности, знаю, тебе будет немного больно, но позже, тебе будет очень приятно.\n  Когда я закончила раздеваться, то взяла страпон и надела его.\n  Я положила руки ей на трусики и чуть погладила их рукой. Она была такой невинной. Мне это дико нравилось, но сегодня она перестанет быть такой. Я сорвала одним движением с нее трусы. Она замычала. Я шлепнула ее по голой киске.\n  - Заткнись!\n Ее киска была очень аккуратной и нежной. Я провела пальчиком по губкам и подразнила клитор, она вздрогнула. Массируя клитор, я добилась того, что она стала мокрой.\n - Шлюха.. какая же ты шлюха!\n Я шлепнула ее по киске, а из ее глаз покатились слезы, они меня манили. Я вставила в нее один пальчик и дала привыкнуть к новым ощущениям. Я начала им двигать, внутри нее было очень узко и мне это нравилось. Я первая, эта мысль вскружила мне голову. Я поняла, что не могу больше сдерживаться и встала так, чтобы упираться страпоном ей в киску. Она жалобно промычала, но я не обращала на нее никакого внимания. Я медленно погладила ее нежный вход страпоном и медленно начала входить, было туго и мне пришлось добавить искусственной смазки. Дело пошло лучше, но ей было больно, а страпон был не самым маленьким. Я гладила ее по волосам и медленно входила до конца. Когда я поняла, что вошла полностью, я остановилась и дала ей пару минут привыкнуть, а пока достала вибратор и приставила его к своему клитору. Мне стало дико приятно и я начала очень быстро двигаться в ней, насилуя ее, причиняя боль. Я упивалась своей властью над ней, она плакала и пыталась кричать, но я слышала только собственные стоны. Я ставила ей засосы на шее и прекрасных грудях, я целовала ее соленые щеки и стонала от удовольствия. Наконец я кончила и остановилась. Когда я вытащила страпон, он был весь в крови, но мне было все равно. Я протерла ее салфеткой, сняла страпон и ее кляп. Быстро дала ей снотворное и накрыла одеялом.\n Ложась спать в другой комнате, я уже предвкушала завтрашний день.")
                                            break

                                        if "2":
                                            break


                                    if "2":
                                        print("Сдесь отмосфера крутая, да и от дама не далеко")
                                        input("1) Часто здесь бываешь? \n 2) Отлично")
                                        if "1":
                                            print("Не хочешь от сюда удалиться?")
                                            input("1) Да \n 2) Нет")
                                            if"1":
                                                print("Вы поехали к ней домой...")
                                                print("Дома... \n Зайдя в квартиру, я сразу потащила Алю мыть ручки. После я включила сериал, который мы собирались посмотреть. Усевшись удобно на диване, мы начали смотреть. \n Я никак не могла сосредоточиться и постоянно мой взгляд падал на губы Али. Они очень соблазнительные, большие, идеальной формы, красивого розового оттенка. Мне так и хотелось их поцеловать и укусить до крови, но я старалась держать себя в руках.\n Спустя примерно пол часа, я решила предложить ей сладенькое, Аля с удовольствием согласилась. Я принесла конфеты и мы сели дальше смотреть, я следила за тем, чтобы не съесть случайно конфету со снотворным и к счастью у меня оказалась отличная память.\n Я заснула время, Аля съела штук пять конфет с секретом. Спустя минут десять, она легла на мои колени и незаметно для себя заснула. Я начала действовать, времени было немного.\n Я выключила сериал и перетащила Алю на кровать. Я начала ее раздевать, увидев очень милые розовые трусики, я оставила их на ней. Сняв все, я достала верёвку и начала связывать ее, привязывая конечности так, что она лежала в позе морской звёзды. Дальше я достала кляп и вставила ей его в ротик. Дальше я села рядом и начала ждать ее пробуждения, самое интересное было впереди...\n Прошло пятнадцать минут...\n Аля медленно открыла глаза и попыталась пошевелиться. Когда она не смогла это сделать, то резко открыла глаза и попыталась что-то произнести.\n - С пробуждением, солнышко! Как же долго, я этого ждала, прости, но пока говорить ты не можешь, но я надеюсь тебе понравится)\n Я достала из под кровати игрушки. Глаза Али округлились.\n - О, я вижу тебе уже нравится)\n Я начала раздеваться догола и поняла, что уже очень сильно возбуждена.\n - Знаешь, а ведь сегодня ты лишишься девственности, знаю, тебе будет немного больно, но позже, тебе будет очень приятно.\n  Когда я закончила раздеваться, то взяла страпон и надела его.\n  Я положила руки ей на трусики и чуть погладила их рукой. Она была такой невинной. Мне это дико нравилось, но сегодня она перестанет быть такой. Я сорвала одним движением с нее трусы. Она замычала. Я шлепнула ее по голой киске.\n  - Заткнись!\n Ее киска была очень аккуратной и нежной. Я провела пальчиком по губкам и подразнила клитор, она вздрогнула. Массируя клитор, я добилась того, что она стала мокрой.\n - Шлюха.. какая же ты шлюха!\n Я шлепнула ее по киске, а из ее глаз покатились слезы, они меня манили. Я вставила в нее один пальчик и дала привыкнуть к новым ощущениям. Я начала им двигать, внутри нее было очень узко и мне это нравилось. Я первая, эта мысль вскружила мне голову. Я поняла, что не могу больше сдерживаться и встала так, чтобы упираться страпоном ей в киску. Она жалобно промычала, но я не обращала на нее никакого внимания. Я медленно погладила ее нежный вход страпоном и медленно начала входить, было туго и мне пришлось добавить искусственной смазки. Дело пошло лучше, но ей было больно, а страпон был не самым маленьким. Я гладила ее по волосам и медленно входила до конца. Когда я поняла, что вошла полностью, я остановилась и дала ей пару минут привыкнуть, а пока достала вибратор и приставила его к своему клитору. Мне стало дико приятно и я начала очень быстро двигаться в ней, насилуя ее, причиняя боль. Я упивалась своей властью над ней, она плакала и пыталась кричать, но я слышала только собственные стоны. Я ставила ей засосы на шее и прекрасных грудях, я целовала ее соленые щеки и стонала от удовольствия. Наконец я кончила и остановилась. Когда я вытащила страпон, он был весь в крови, но мне было все равно. Я протерла ее салфеткой, сняла страпон и ее кляп. Быстро дала ей снотворное и накрыла одеялом.\n Ложась спать в другой комнате, я уже предвкушала завтрашний день.")
                                            if "2":
                                                break
                                        if "2":
                                            break

                                if"2":
                                    break

                            if"2":
                                print("Нет")
                                break

                        if"2":
                            print("Да так, ничего")
                            break
                    if"2":
                        print("Привет")
                        input("Что Выбереш?: 1) Как дела? 2) Чё сидим?")
                        if"1":
                            print("Норм")
                            break
                        if"2":
                            break


                else:
                    break


    elif choice == "2":
            if buy(weaponCost):
                print("Отлично")

    else:
            print("Я такое не продаю.")

def initGame(initCoins):
    global coins

    coins = initCoins

initGame(5)



